var provinceSelector="#areaProvince";
var citySelector="#areaCity";
var districtSelector="#areaDistrict";

//var defaultprovinceText=;
var defaultCityText="请选择城市";
var defaultDistrictText="请选择县/区";

var province = ['北京','上海','天津','重庆','河北省','山西省','内蒙古自治区','辽宁省','吉林省','黑龙江省','江苏省','浙江省','安徽省','福建省','江西省','山东省','河南省','湖北省','湖南省','广东省','广西壮族自治区','海南省','四川省','贵州省','云南省','西藏自治区','陕西省','甘肃省','青海省','宁夏回族自治区','新疆维吾尔自治区','澳门特别行政区','海外'];
var city = [];
//北京
city[0] = [
	{city:'北京市',data:['顺义区','门头沟区','崇文区','密云县','大兴区','怀柔区','延庆县','宣武区','西城区','平谷区','东城区','昌平区','丰台区','石景山区','房山区','朝阳区','海淀区','其它区','通州区']}
];

//上海
city[1] = [
	{city:'上海市',data:['长宁区','闵行区','宝山区','徐汇区','黄浦区','浦东新区','闸北区','普陀区','南汇区','嘉定区','崇明县','松江区','金山区','虹口区','卢湾区','青浦区','川沙区','静安区','杨浦区','其它区','奉贤区']}
];

//天津
city[2] = [
	{city:'天津市',data:['静海县','河东区','南开区','北辰区','塘沽区','河西区','红桥区','东丽区','蓟县','宁河县','津南区','汉沽区','河北区','西青区','和平区','宝坻区','武清区','大港区','其它区','滨海新区']}
];

//重庆
city[3] = [
	{city:'重庆市',data:['奉节县','荣昌县','永川区','忠县','万州区','黔江区','酉阳土家族苗族自治县','沙坪坝区','长寿区','双桥区','城口县','南岸区','南川区','江津区','铜梁县','巴南区','武隆县','云阳县','江北区','大渡口区','潼南县','渝中区','九龙坡区','丰都县','涪陵区','开县','巫山县','垫江县','梁平县','渝北区','大足县','秀山土家族苗族自治县','綦江县','璧山县','合川区','彭水苗族土家族自治县','万盛区','巫溪县','北碚区','其它区','石柱土家族自治县']}
];

//河北省
city[4] = [
	{city:'秦皇岛市',data:['北戴河区','卢龙县','经济技术开发区','青龙满族自治县','昌黎县','山海关区','海港区','抚宁县','其它区']},
	{city:'张家口市',data:['万全县','沽源县','赤城县','涿鹿县','怀安县','宣化区','康保县','桥东区','阳原县','尚义县','桥西区','蔚县','宣化县','张北县','崇礼县','怀来县','下花园区','其它区']},
	{city:'保定市',data:['满城县','高碑店市','蠡县','唐县','阜平县','南市区','顺平县','安新县','北市区','定兴县','博野县','高开区','高阳县','徐水县','定州市','涿州市','安国市','曲阳县','涞源县','清苑县','易县','新市区','容城县','涞水县','望都县','雄县','其它区']},
	{city:'唐山市',data:['迁西县','路南区','遵化市','丰南区','丰润区','唐海县','路北区','开平区','玉田县','滦县','古冶区','迁安市','滦南县','乐亭县','其它区']},
	{city:'廊坊市',data:['永清县','香河县','三河市','广阳区','大厂回族自治县','固安县','燕郊经济技术开发区','开发区','文安县','大城县','安次区','霸州市','其它区']},
	{city:'沧州市',data:['河间市','黄骅市','吴桥县','海兴县','孟村回族自治县','沧县','任丘市','新华区','泊头市','青县','献县','东光县','运河区','南皮县','盐山县','肃宁县','其它区']},
	{city:'衡水市',data:['景县','饶阳县','安平县','阜城县','桃城区','故城县','冀州市','枣强县','武邑县','其它区','深州市','武强县']},
	{city:'邯郸市',data:['邱县','广平县','成安县','馆陶县','复兴区','鸡泽县','临漳县','磁县','永年县','邯山区','丛台区','武安市','肥乡县','曲周县','魏县','涉县','峰峰矿区','其它区','邯郸县','大名县']},
	{city:'邢台市',data:['宁晋县','南宫市','巨鹿县','广宗县','威县','柏乡县','内丘县','桥东区','临城县','桥西区','清河县','邢台县','平乡县','南和县','新河县','沙河市','任县','临西县','隆尧县','其它区']},
	{city:'承德市',data:['承德县','丰宁满族自治县','滦平县','围场满族蒙古族自治县','兴隆县','宽城满族自治县','平泉县','双桥区','隆化县','鹰手营子矿区','双滦区','其它区']},
	{city:'石家庄市',data:['辛集市','平山县','灵寿县','正定县','藁城市','行唐县','鹿泉市','新乐市','井陉县','井陉矿区','赵县','桥东区','桥西区','新华区','深泽县','赞皇县','元氏县','晋州市','裕华区','栾城县','高邑县','其它区','无极县','长安区']}
];

//山西省
city[5] = [
	{city:'运城市',data:['盐湖区','临猗县','永济市','平陆县','万荣县','新绛县','垣曲县','稷山县','河津市','绛县','芮城县','闻喜县','夏县','其它区']},
	{city:'忻州市',data:['偏关县','宁武县','五台县','岢岚县','保德县','定襄县','忻府区','五寨县','繁峙县','神池县','河曲县','静乐县','原平市','代县','其它区']},
	{city:'朔州市',data:['山阴县','朔城区','应县','右玉县','怀仁县','平鲁区','其它区']},
	{city:'阳泉市',data:['盂县','城区','平定县','郊区','矿区','其它区']},
	{city:'晋中市',data:['榆次区','介休市','太谷县','和顺县','榆社县','平遥县','左权县','昔阳县','灵石县','祁县','寿阳县','其它区']},
	{city:'长治市',data:['潞城市','黎城县','壶关县','城区','屯留县','长治县','郊区','襄垣县','平顺县','沁源县','高新区','长子县','武乡县','其它区','沁县']},
	{city:'大同市',data:['城区','灵丘县','南郊区','新荣区','广灵县','天镇县','浑源县','阳高县','左云县','大同县','其它区','矿区']},
	{city:'晋城市',data:['城区','高平市','阳城县','沁水县','陵川县','泽州县','其它区']},
	{city:'临汾市',data:['隰县','乡宁县','曲沃县','蒲县','古县','洪洞县','尧都区','霍州市','汾西县','襄汾县','翼城县','吉县','安泽县','浮山县','大宁县','永和县','其它区','侯马市']},
	{city:'太原市',data:['小店区','迎泽区','晋源区','古交市','万柏林区','尖草坪区','娄烦县','杏花岭区','阳曲县','其它区','清徐县']},
	{city:'吕梁市',data:['交口县','汾阳市','石楼县','岚县','离石区','临县','兴县','孝义市','交城县','柳林县','中阳县','文水县','其它区','方山县']}
];

//内蒙古自治区
city[6] = [
	{city:'阿拉善盟',data:['阿拉善右旗','阿拉善左旗','额济纳旗','其它区']},
	{city:'巴彦淖尔市',data:['乌拉特后旗','临河区','五原县','乌拉特中旗','乌拉特前旗','磴口县','其它区','杭锦后旗']},
	{city:'包头市',data:['九原区','石拐区','东河区','昆都仑区','青山区','土默特右旗','其它区','白云矿区','固阳县','达尔罕茂明安联合旗']},
	{city:'鄂尔多斯市',data:['达拉特旗','鄂托克旗','准格尔旗','乌审旗','鄂托克前旗','杭锦旗','伊金霍洛旗','其它区','东胜区']},
	{city:'乌海市',data:['乌达区','海勃湾区','海南区','其它区']},
	{city:'通辽市',data:['科尔沁左翼后旗','奈曼旗','科尔沁左翼中旗','库伦旗','开鲁县','扎鲁特旗','霍林郭勒市','科尔沁区','其它区']},
	{city:'兴安盟',data:['阿尔山市','突泉县','科尔沁右翼前旗','乌兰浩特市','扎赉特旗','其它区','科尔沁右翼中旗']},
	{city:'呼和浩特市',data:['武川县','赛罕区','清水河县','新城区','和林格尔县','回民区','土默特左旗','托克托县','其它区','玉泉区']},
	{city:'呼伦贝尔市',data:['满洲里市','新巴尔虎左旗','根河市','阿荣旗','陈巴尔虎旗','扎兰屯市','牙克石市','鄂伦春自治旗','海拉尔区','新巴尔虎右旗','鄂温克族自治旗','莫力达瓦达斡尔族自治旗','额尔古纳市','其它区']},
	{city:'锡林郭勒盟',data:['苏尼特右旗','太仆寺旗','锡林浩特市','西乌珠穆沁旗','苏尼特左旗','东乌珠穆沁旗','多伦县','正蓝旗','镶黄旗','二连浩特市','正镶白旗','阿巴嘎旗','其它区']},
	{city:'乌兰察布市',data:['卓资县','察哈尔右翼后旗','兴和县','四子王旗','察哈尔右翼中旗','商都县','察哈尔右翼前旗','化德县','丰镇市','凉城县','集宁区','其它区']},
	{city:'赤峰市',data:['喀喇沁旗','林西县','巴林右旗','敖汉旗','克什克腾旗','宁城县','翁牛特旗','元宝山区','红山区','阿鲁科尔沁旗','巴林左旗','松山区','其它区']}
];

//辽宁省
city[7] = [
	{city:'鞍山市',data:['铁东区','海城市','立山区','台安县','千山区','铁西区','高新区','岫岩满族自治县','其它区']},
	{city:'本溪市',data:['明山区','平山区','溪湖区','桓仁满族自治县','本溪满族自治县','南芬区','其它区']},
	{city:'大连市',data:['沙河口区','旅顺口区','岭前区','庄河市','甘井子区','长海县','普兰店市','开发区','中山区','金州区','西岗区','其它区','瓦房店市']},
	{city:'锦州市',data:['义县','古塔区','太和区','凌河区','北镇市','其它区','凌海市','黑山县']},
	{city:'营口市',data:['西市区','盖州市','站前区','大石桥市','老边区','其它区','鲅鱼圈区']},
	{city:'丹东市',data:['宽甸满族自治县','振安区','东港市','振兴区','凤城市','元宝区','其它区']},
	{city:'辽阳市',data:['太子河区','宏伟区','辽阳县','白塔区','弓长岭区','文圣区','其它区','灯塔市']},
	{city:'朝阳市',data:['建平县','龙城区','喀喇沁左翼蒙古族自治县','双塔区','朝阳县','凌源市','其它区','北票市']},
	{city:'阜新市',data:['清河门区','彰武县','细河区','新邱区','海州区','阜新蒙古族自治县','太平区','其它区']},
	{city:'葫芦岛市',data:['龙港区','建昌县','连山区','兴城市','绥中县','南票区','其它区']},
	{city:'盘锦市',data:['双台子区','盘山县','兴隆台区','大洼县','其它区']},
	{city:'沈阳市',data:['于洪区','张士开发区','康平县','浑南新区','大东区','沈河区','皇姑区','东陵区','铁西区','和平区','新民市','沈北新区','法库县','辽中县','其它区','苏家屯区','新城子区']},
	{city:'抚顺市',data:['新宾满族自治县','顺城区','望花区','抚顺县','新抚区','其它区','清原满族自治县','东洲区']},
	{city:'铁岭市',data:['调兵山市','昌图县','银州区','开原市','西丰县','铁岭县','其它区','清河区']}
];

//吉林省
city[8] = [
	{city:'松原市',data:['宁江区','乾安县','扶余县','长岭县','其它区','前郭尔罗斯蒙古族自治县']},
	{city:'辽源市',data:['西安区','龙山区','东丰县','东辽县','其它区']},
	{city:'长春市',data:['汽车产业开发区','高新技术产业开发区','榆树市','二道区','绿园区','九台市','宽城区','经济技术开发区','南关区','朝阳区','双阳区','净月旅游开发区','德惠市','其它区','农安县']},
	{city:'延边朝鲜族自治州',data:['汪清县','图们市','敦化市','龙井市','安图县','延吉市','珲春市','和龙市','其它区']},
	{city:'通化市',data:['二道江区','辉南县','梅河口市','东昌区','集安市','柳河县','其它区','通化县']},
	{city:'吉林市',data:['昌邑区','永吉县','丰满区','龙潭区','船营区','磐石市','舒兰市','桦甸市','其它区','蛟河市']},
	{city:'白城市',data:['镇赉县','大安市','洮北区','洮南市','通榆县','其它区']},
	{city:'四平市',data:['铁东区','双辽市','铁西区','梨树县','公主岭市','伊通满族自治县','其它区']},
	{city:'白山市',data:['靖宇县','临江市','长白朝鲜族自治县','抚松县','其它区','江源县','八道江区']}
];

//黑龙江省
city[9] = [
	{city:'齐齐哈尔市',data:['龙沙区','铁锋区','依安县','讷河市','甘南县','富裕县','富拉尔基区','碾子山区','梅里斯达斡尔族区','昂昂溪区','泰来县','克东县','龙江县','拜泉县','克山县','建华区','其它区']},
	{city:'大兴安岭地区',data:['呼玛县','加格达奇区','漠河县','塔河县','其它区']},
	{city:'绥化市',data:['望奎县','绥棱县','庆安县','兰西县','肇东市','青冈县','安达市','明水县','北林区','其它区','海伦市']},
	{city:'伊春市',data:['铁力市','友好区','上甘岭区','新青区','伊春区','南岔区','西林区','汤旺河区','五营区','金山屯区','带岭区','红星区','乌马河区','乌伊岭区','翠峦区','其它区','嘉荫县','美溪区']},
	{city:'双鸭山市',data:['尖山区','岭东区','宝山区','友谊县','宝清县','集贤县','四方台区','饶河县','其它区']},
	{city:'佳木斯市',data:['同江市','富锦市','前进区','郊区','桦南县','向阳区','汤原县','东风区','抚远县','永红区','其它区','桦川县']},
	{city:'七台河市',data:['勃利县','新兴区','桃山区','茄子河区','其它区']},
	{city:'哈尔滨市',data:['动力区','通河县','方正县','尚志市','木兰县','香坊区','双城市','依兰县','延寿县','五常市','南岗区','平房区','巴彦县','呼兰区','阿城市','道里区','道外区','其它区','宾县','松北区']},
	{city:'大庆市',data:['林甸县','萨尔图区','杜尔伯特蒙古族自治县','龙凤区','肇州县','大同区','肇源县','红岗区','其它区','让胡路区']},
	{city:'牡丹江市',data:['西安区','穆棱市','东安区','林口县','阳明区','宁安市','爱民区','海林市','绥芬河市','其它区','东宁县']},
	{city:'鹤岗市',data:['兴安区','东山区','绥滨县','萝北县','向阳区','兴山区','南山区','其它区','工农区']},
	{city:'黑河市',data:['孙吴县','逊克县','爱辉区','嫩江县','五大连池市','北安市','其它区']},
	{city:'鸡西市',data:['鸡东县','密山市','虎林市','鸡冠区','梨树区','城子河区','滴道区','恒山区','其它区','麻山区']}
];

//江苏省
city[10] = [
	{city:'徐州市',data:['新沂市','泉山区','铜山县','沛县','贾汪区','丰县','九里区','邳州市','睢宁县','其它区','鼓楼区','云龙区']},
	{city:'泰州市',data:['靖江市','高港区','海陵区','泰兴市','兴化市','其它区','姜堰市']},
	{city:'南京市',data:['下关区','江宁区','六合区','栖霞区','溧水县','秦淮区','浦口区','建邺区','高淳县','白下区','雨花台区','玄武区','鼓楼区','其它区']},
	{city:'常州市',data:['新北区','钟楼区','金坛市','溧阳市','武进区','其它区','戚墅堰区','天宁区']},
	{city:'镇江市',data:['扬中市','润州区','丹阳市','丹徒区','京口区','句容市','其它区']},
	{city:'宿迁市',data:['泗洪县','泗阳县','宿豫区','沭阳县','其它区','宿城区']},
	{city:'苏州市',data:['平江区','昆山市','虎丘区','园区','金阊区','相城区','新区','常熟市','沧浪区','太仓市','吴江市','吴中区','张家港市','其它区']},
	{city:'连云港市',data:['赣榆县','东海县','灌南县','连云区','海州区','灌云县','其它区','新浦区']},
	{city:'无锡市',data:['崇安区','新区','惠山区','锡山区','北塘区','宜兴市','南长区','江阴市','滨湖区','其它区']},
	{city:'盐城市',data:['东台市','建湖县','阜宁县','大丰市','滨海县','盐都区','射阳县','响水县','其它区','亭湖区']},
	{city:'扬州市',data:['维扬区','邗江区','经济开发区','广陵区','高邮市','江都市','宝应县','其它区','仪征市']},
	{city:'淮安市',data:['楚州区','涟水县','淮阴区','洪泽县','金湖县','盱眙县','清浦区','清河区','其它区']},
	{city:'南通市',data:['港闸区','启东市','通州市','开发区','海门市','如东县','海安县','崇川区','如皋市','其它区','通州区']}
];

//浙江省
city[11] = [
	{city:'杭州市',data:['淳安县','滨江区','拱墅区','余杭区','建德市','上城区','下城区','萧山区','桐庐县','西湖区','富阳市','临安市','江干区','其它区']},
	{city:'绍兴市',data:['嵊州市','上虞市','新昌县','诸暨市','绍兴县','其它区','越城区']},
	{city:'湖州市',data:['安吉县','长兴县','南浔区','吴兴区','其它区','德清县']},
	{city:'温州市',data:['瑞安市','文成县','永嘉县','瓯海区','鹿城区','苍南县','平阳县','龙湾区','泰顺县','乐清市','其它区','洞头县']},
	{city:'台州市',data:['仙居县','临海市','天台县','椒江区','温岭市','玉环县','三门县','黄岩区','路桥区','其它区']},
	{city:'舟山市',data:['普陀区','嵊泗县','岱山县','定海区','其它区']},
	{city:'宁波市',data:['奉化市','余姚市','象山县','北仑区','江北区','镇海区','慈溪市','宁海县','鄞州区','江东区','其它区','海曙区']},
	{city:'丽水市',data:['龙泉市','景宁畲族自治县','缙云县','云和县','青田县','庆元县','莲都区','遂昌县','松阳县','其它区']},
	{city:'金华市',data:['磐安县','永康市','兰溪市','金东区','武义县','东阳市','义乌市','浦江县','其它区','婺城区']},
	{city:'嘉兴市',data:['平湖市','海盐县','南湖区','嘉善县','桐乡市','海宁市','秀洲区','其它区']},
	{city:'衢州市',data:['常山县','衢江区','龙游县','江山市','开化县','柯城区','其它区']}
];

//安徽省
city[12] = [
	{city:'淮南市',data:['谢家集区','八公山区','凤台县','大通区','田家庵区','潘集区','其它区']},
	{city:'池州市',data:['青阳县','东至县','贵池区','石台县','其它区']},
	{city:'宿州市',data:['萧县','泗县','砀山县','埇桥区','灵璧县','其它区']},
	{city:'安庆市',data:['望江县','宿松县','太湖县','潜山县','岳西县','枞阳县','桐城市','宜秀区','怀宁县','其它区','大观区','迎江区']},
	{city:'马鞍山市',data:['雨山区','当涂县','金家庄区','花山区','其它区']},
	{city:'巢湖市',data:['庐江县','无为县','居巢区','和县','含山县','其它区']},
	{city:'亳州市',data:['涡阳县','利辛县','谯城区','蒙城县','其它区']},
	{city:'合肥市',data:['蜀山区','长丰县','高新区','中区','庐阳区','包河区','肥西县','肥东县','瑶海区','其它区']},
	{city:'滁州市',data:['琅琊区','凤阳县','南谯区','明光市','来安县','天长市','定远县','全椒县','其它区']},
	{city:'阜阳市',data:['阜南县','太和县','颍泉区','界首市','颍上县','颍州区','颍东区','临泉县','其它区']},
	{city:'宣城市',data:['泾县','旌德县','广德县','郎溪县','宁国市','宣州区','其它区','绩溪县']},
	{city:'淮北市',data:['杜集区','相山区','濉溪县','烈山区','其它区']},
	{city:'黄山市',data:['休宁县','歙县','徽州区','黟县','黄山区','屯溪区','祁门县','其它区']},
	{city:'铜陵市',data:['铜官山区','铜陵县','郊区','狮子山区','其它区']},
	{city:'蚌埠市',data:['禹会区','固镇县','龙子湖区','五河县','怀远县','淮上区','蚌山区','其它区']},
	{city:'六安市',data:['舒城县','金寨县','霍山县','金安区','寿县','霍邱县','其它区','裕安区']},
	{city:'芜湖市',data:['镜湖区','南陵县','三山区','鸠江区','芜湖县','弋江区','繁昌县','其它区']}
];

//福建省
city[13] = [
	{city:'福州市',data:['罗源县','永泰县','闽清县','马尾区','闽侯县','台江区','平潭县','连江县','仓山区','晋安区','长乐市','福清市','其它区','鼓楼区']},
	{city:'厦门市',data:['湖里区','翔安区','海沧区','同安区','思明区','集美区','其它区']},
	{city:'南平市',data:['政和县','建阳市','武夷山市','邵武市','延平区','松溪县','顺昌县','浦城县','其它区','建瓯市','光泽县']},
	{city:'泉州市',data:['安溪县','南安市','德化县','丰泽区','惠安县','洛江区','晋江市','永春县','石狮市','鲤城区','泉港区','金门县','其它区']},
	{city:'漳州市',data:['南靖县','诏安县','东山县','龙文区','漳浦县','龙海市','云霄县','芗城区','长泰县','平和县','其它区','华安县']},
	{city:'三明市',data:['宁化县','将乐县','泰宁县','大田县','清流县','明溪县','沙县','尤溪县','梅列区','永安市','三元区','其它区','建宁县']},
	{city:'龙岩市',data:['连城县','永定县','新罗区','上杭县','武平县','漳平市','长汀县','其它区']},
	{city:'莆田市',data:['秀屿区','荔城区','仙游县','涵江区','其它区','城厢区']},
	{city:'宁德市',data:['屏南县','蕉城区','寿宁县','古田县','柘荣县','福安市','福鼎市','霞浦县','其它区','周宁县']}
];

//江西省
city[14] = [
	{city:'鹰潭市',data:['月湖区','贵溪市','余江县','其它区']},
	{city:'吉安市',data:['新干县','永新县','万安县','吉安县','永丰县','安福县','吉州区','泰和县','吉水县','井冈山市','峡江县','遂川县','其它区','青原区']},
	{city:'萍乡市',data:['安源区','芦溪县','上栗县','莲花县','其它区','湘东区']},
	{city:'九江市',data:['庐山区','永修县','彭泽县','都昌县','修水县','瑞昌市','星子县','湖口县','德安县','武宁县','九江县','浔阳区','其它区']},
	{city:'抚州市',data:['南城县','宜黄县','崇仁县','临川区','乐安县','金溪县','资溪县','黎川县','东乡县','南丰县','广昌县','其它区']},
	{city:'南昌市',data:['湾里区','青云谱区','青山湖区','东湖区','进贤县','新建县','西湖区','昌北区','经济技术开发区','南昌县','安义县','其它区','红谷滩新区']},
	{city:'上饶市',data:['婺源县','鄱阳县','万年县','铅山县','玉山县','信州区','横峰县','余干县','德兴市','弋阳县','广丰县','上饶县','其它区']},
	{city:'新余市',data:['分宜县','渝水区','其它区']},
	{city:'宜春市',data:['高安市','铜鼓县','上高县','宜丰县','万载县','袁州区','靖安县','其它区','丰城市','樟树市','奉新县']},
	{city:'景德镇市',data:['乐平市','浮梁县','昌江区','其它区','珠山区']},
	{city:'赣州市',data:['章贡区','瑞金市','崇义县','石城县','上犹县','定南县','龙南县','于都县','南康市','寻乌县','信丰县','会昌县','全南县','赣县','大余县','兴国县','黄金区','安远县','其它区','宁都县']}
];

//山东省
city[15] = [
	{city:'淄博市',data:['张店区','临淄区','博山区','淄川区','桓台县','周村区','沂源县','其它区','高青县']},
	{city:'滨州市',data:['惠民县','滨城区','无棣县','沾化县','阳信县','博兴县','邹平县','其它区']},
	{city:'烟台市',data:['莱阳市','栖霞市','牟平区','长岛县','龙口市','莱州市','福山区','蓬莱市','莱山区','芝罘区','招远市','其它区','海阳市']},
	{city:'济南市',data:['历城区','天桥区','槐荫区','济阳县','历下区','市中区','长清区','平阴县','商河县','章丘市','其它区']},
	{city:'泰安市',data:['泰山区','新泰市','宁阳县','东平县','岱岳区','肥城市','其它区']},
	{city:'临沂市',data:['河东区','罗庄区','费县','莒南县','蒙阴县','沂水县','兰山区','临沭县','沂南县','苍山县','郯城县','平邑县','其它区']},
	{city:'聊城市',data:['莘县','阳谷县','茌平县','高唐县','冠县','东阿县','临清市','东昌府区','其它区']},
	{city:'潍坊市',data:['高密市','青州市','临朐县','昌邑市','寿光市','奎文区','寒亭区','潍城区','开发区','昌乐县','诸城市','安丘市','其它区','坊子区']},
	{city:'青岛市',data:['平度市','市南区','胶州市','四方区','城阳区','开发区','李沧区','胶南市','崂山区','市北区','黄岛区','即墨市','莱西市','其它区']},
	{city:'枣庄市',data:['峄城区','滕州市','山亭区','市中区','薛城区','其它区','台儿庄区']},
	{city:'德州市',data:['夏津县','武城县','宁津县','平原县','禹城市','临邑县','开发区','齐河县','庆云县','德城区','陵县','其它区','乐陵市']},
	{city:'莱芜市',data:['莱城区','钢城区','其它区']},
	{city:'东营市',data:['东营区','垦利县','东城区','广饶县','河口区','利津县','西城区','其它区']},
	{city:'威海市',data:['文登市','荣成市','环翠区','其它区','乳山市']},
	{city:'济宁市',data:['金乡县','嘉祥县','任城区','兖州市','微山县','邹城市','鱼台县','汶上县','曲阜市','梁山县','市中区','泗水县','其它区']},
	{city:'日照市',data:['五莲县','莒县','岚山区','东港区','其它区']},
	{city:'菏泽市',data:['单县','巨野县','东明县','定陶县','郓城县','牡丹区','成武县','曹县','其它区','鄄城县']}
];

//河南省
city[16] = [
	{city:'三门峡市',data:['卢氏县','陕县','湖滨区','灵宝市','义马市','其它区','渑池县']},
	{city:'洛阳市',data:['涧西区','新安县','洛宁县','伊川县','宜阳县','栾川县','老城区','廛河回族区','洛龙区','汝阳县','西工区','吉利区','高新区','孟津县','嵩县','其它区','偃师市']},
	{city:'周口市',data:['淮阳县','扶沟县','太康县','西华县','沈丘县','商水县','川汇区','鹿邑县','郸城县','其它区','项城市']},
	{city:'鹤壁市',data:['淇滨区','浚县','山城区','淇县','鹤山区','其它区']},
	{city:'安阳市',data:['林州市','文峰区','殷都区','北关区','汤阴县','安阳县','龙安区','滑县','内黄县','其它区']},
	{city:'平顶山市',data:['叶县','湛河区','宝丰县','鲁山县','卫东区','舞钢市','郏县','石龙区','新华区','其它区','汝州市']},
	{city:'商丘市',data:['夏邑县','民权县','睢县','睢阳区','柘城县','虞城县','梁园区','其它区','宁陵县','永城市']},
	{city:'漯河市',data:['郾城区','临颍县','召陵区','源汇区','舞阳县','其它区']},
	{city:'濮阳市',data:['南乐县','台前县','清丰县','濮阳县','其它区','范县','华龙区']},
	{city:'郑州市',data:['管城回族区','登封市','金水区','惠济区','荥阳市','新郑市','上街区','高新区','郑东新区','中牟县','新密市','巩义市','中原区','二七区','其它区']},
	{city:'驻马店市',data:['正阳县','泌阳县','新蔡县','遂平县','汝南县','上蔡县','西平县','驿城区','其它区','平舆县','确山县']},
	{city:'信阳市',data:['罗山县','新县','固始县','光山县','商城县','淮滨县','浉河区','潢川县','息县','平桥区','其它区']},
	{city:'南阳市',data:['新野县','南召县','邓州市','内乡县','卧龙区','桐柏县','西峡县','社旗县','方城县','淅川县','唐河县','其它区','镇平县','宛城区']},
	{city:'济源市',data:['济源市']},
	{city:'焦作市',data:['山阳区','沁阳市','武陟县','博爱县','中站区','修武县','解放区','马村区','其它区','温县','孟州市']},
	{city:'许昌市',data:['长葛市','禹州市','许昌县','魏都区','鄢陵县','其它区','襄城县']},
	{city:'开封市',data:['尉氏县','通许县','杞县','兰考县','龙亭区','开封县','顺河回族区','禹王台区','金明区','鼓楼区','其它区']},
	{city:'新乡市',data:['长垣县','红旗区','辉县市','获嘉县','卫辉市','凤泉区','封丘县','牧野区','原阳县','延津县','卫滨区','新乡县','其它区']}
];

//湖北省
city[17] = [
	{city:'鄂州市',data:['梁子湖区','鄂城区','其它区','华容区']},
	{city:'仙桃市',data:['仙桃市']},
	{city:'黄冈市',data:['蕲春县','黄梅县','武穴市','罗田县','英山县','红安县','麻城市','黄州区','团风县','浠水县','其它区']},
	{city:'荆州市',data:['松滋市','监利县','石首市','荆州区','公安县','江陵县','沙市区','洪湖市','其它区']},
	{city:'随州市',data:['广水市','随县','曾都区','其它区']},
	{city:'黄石市',data:['阳新县','大冶市','铁山区','西塞山区','下陆区','其它区','黄石港区']},
	{city:'潜江市',data:['潜江市']},
	{city:'襄阳市',data:['老河口市','南漳县','襄城区','枣阳市','保康县','谷城县','樊城区','襄州区','宜城市','其它区']},
	{city:'神农架林区',data:['神农架林区']},
	{city:'孝感市',data:['安陆市','孝南区','应城市','孝昌县','大悟县','云梦县','其它区','汉川市']},
	{city:'恩施土家族苗族自治州',data:['咸丰县','利川市','鹤峰县','巴东县','宣恩县','来凤县','建始县','恩施市','其它区']},
	{city:'武汉市',data:['武昌区','江夏区','青山区','洪山区','硚口区','黄陂区','汉南区','汉阳区','蔡甸区','江汉区','江岸区','东西湖区','新洲区','其它区']},
	{city:'宜昌市',data:['当阳市','远安县','五峰土家族自治县','枝江市','猇亭区','秭归县','西陵区','点军区','长阳土家族自治县','兴山县','开发区','夷陵区','宜都市','伍家岗区','葛洲坝区','其它区']},
	{city:'荆门市',data:['京山县','掇刀区','沙洋县','东宝区','钟祥市','其它区']},
	{city:'天门市',data:['天门市']},
	{city:'咸宁市',data:['温泉城区','嘉鱼县','崇阳县','赤壁市','通城县','通山县','咸安区','其它区']},
	{city:'十堰市',data:['郧西县','茅箭区','城区','竹溪县','丹江口市','郧县','张湾区','竹山县','房县','其它区']}
];

//湖南省
city[18] = [
	{city:'岳阳市',data:['平江县','君山区','临湘市','汨罗市','云溪区','湘阴县','岳阳楼区','华容县','岳阳县','其它区']},
	{city:'郴州市',data:['桂东县','宜章县','永兴县','北湖区','苏仙区','安仁县','汝城县','资兴市','临武县','嘉禾县','其它区','桂阳县']},
	{city:'衡阳市',data:['雁峰区','衡阳县','南岳区','衡南县','珠晖区','祁东县','常宁市','石鼓区','耒阳市','衡山县','衡东县','蒸湘区','其它区']},
	{city:'怀化市',data:['会同县','洪江市','辰溪县','鹤城区','芷江侗族自治县','溆浦县','中方县','麻阳苗族自治县','通道侗族自治县','沅陵县','靖州苗族侗族自治县','新晃侗族自治县','其它区']},
	{city:'张家界市',data:['慈利县','武陵源区','桑植县','其它区','永定区']},
	{city:'娄底市',data:['双峰县','涟源市','新化县','娄星区','冷水江市','其它区']},
	{city:'湘潭市',data:['雨湖区','湘乡市','岳塘区','湘潭县','韶山市','其它区']},
	{city:'常德市',data:['石门县','桃源县','武陵区','澧县','鼎城区','汉寿县','津市市','安乡县','临澧县','其它区']},
	{city:'长沙市',data:['开福区','宁乡县','芙蓉区','岳麓区','雨花区','天心区','望城县','浏阳市','其它区','长沙县']},
	{city:'湘西土家族苗族自治州',data:['永顺县','保靖县','古丈县','吉首市','凤凰县','花垣县','泸溪县','其它区','龙山县']},
	{city:'永州市',data:['江永县','宁远县','冷水滩区','道县','祁阳县','新田县','零陵区','东安县','双牌县','江华瑶族自治县','其它区','蓝山县']},
	{city:'益阳市',data:['桃江县','安化县','赫山区','资阳区','南县','沅江市','其它区']},
	{city:'株洲市',data:['醴陵市','攸县','炎陵县','株洲县','天元区','茶陵县','石峰区','芦淞区','荷塘区','其它区']},
	{city:'邵阳市',data:['邵东县','邵阳县','隆回县','双清区','城步苗族自治县','新邵县','武冈市','新宁县','北塔区','大祥区','洞口县','其它区','绥宁县']}
];

//广东省
city[19] = [
	{city:'潮州市',data:['潮安县','枫溪区','湘桥区','饶平县','其它区']},
	{city:'珠海市',data:['金湾区','金唐区','南湾区','斗门区','其它区','香洲区']},
	{city:'台山市',data:['']},
	{city:'阳江市',data:['阳东县','阳西县','阳春市','其它区','江城区']},
	{city:'东莞市',data:['东莞市']},
	{city:'韶关市',data:['新丰县','乐昌市','乳源瑶族自治县','南雄市','武江区','翁源县','仁化县','曲江区','始兴县','浈江区','其它区']},
	{city:'茂名市',data:['电白县','高州市','信宜市','化州市','茂南区','其它区','茂港区']},
	{city:'梅州市',data:['大埔县','兴宁市','梅县','平远县','蕉岭县','五华县','其它区','丰顺县','梅江区']},
	{city:'肇庆市',data:['鼎湖区','德庆县','高要市','怀集县','四会市','端州区','封开县','广宁县','其它区']},
	{city:'中山市',data:['中山市']},
	{city:'湛江市',data:['赤坎区','雷州市','吴川市','坡头区','霞山区','遂溪县','麻章区','廉江市','徐闻县','其它区']},
	{city:'清远市',data:['佛冈县','连州市','清城区','阳山县','连山壮族瑶族自治县','连南瑶族自治县','清新县','其它区','英德市']},
	{city:'佛山市',data:['三水区','顺德区','禅城区','南海区','高明区','其它区']},
	{city:'广州市',data:['增城市','越秀区','番禺区','花都区','荔湾区','黄埔区','白云区','东山区','天河区','南沙区','从化市','海珠区','其它区','萝岗区']},
	{city:'汕尾市',data:['陆丰市','城区','陆河县','海丰县','其它区']},
	{city:'惠州市',data:['博罗县','惠城区','龙门县','惠东县','惠阳区','其它区']},
	{city:'深圳市',data:['罗湖区','福田区','宝安区','南山区','盐田区','龙岗区','其它区']},
	{city:'汕头市',data:['金平区','潮阳区','南澳县','龙湖区','濠江区','澄海区','潮南区','其它区']},
	{city:'江门市',data:['蓬江区','江海区','台山市','开平市','新会区','鹤山市','其它区','恩平市']},
	{city:'云浮市',data:['云安县','罗定市','云城区','新兴县','郁南县','其它区']},
	{city:'河源市',data:['源城区','紫金县','和平县','东源县','连平县','龙川县','其它区']},
	{city:'揭阳市',data:['普宁市','揭东县','东山区','榕城区','惠来县','揭西县','其它区']}
];

//广西壮族自治区
city[20] = [
	{city:'钦州市',data:['钦南区','灵山县','浦北县','其它区','钦北区']},
	{city:'贵港市',data:['港北区','覃塘区','港南区','桂平市','平南县','其它区']},
	{city:'柳州市',data:['融水苗族自治县','城中区','柳北区','柳江县','鱼峰区','鹿寨县','融安县','三江侗族自治县','柳南区','柳城县','其它区']},
	{city:'防城港市',data:['东兴市','港口区','防城区','其它区','上思县']},
	{city:'河池市',data:['天峨县','巴马瑶族自治县','南丹县','环江毛南族自治县','宜州市','罗城仫佬族自治县','东兰县','大化瑶族自治县','金城江区','凤山县','其它区','都安瑶族自治县']},
	{city:'来宾市',data:['武宣县','兴宾区','忻城县','金秀瑶族自治县','合山市','象州县','其它区']},
	{city:'贺州市',data:['昭平县','八步区','钟山县','富川瑶族自治县','其它区']},
	{city:'百色市',data:['西林县','乐业县','右江区','田林县','德保县','田东县','那坡县','凌云县','靖西县','平果县','隆林各族自治县','其它区','田阳县']},
	{city:'崇左市',data:['凭祥市','江州区','扶绥县','宁明县','天等县','龙州县','其它区','大新县']},
	{city:'桂林市',data:['资源县','永福县','荔浦县','秀峰区','灵川县','恭城瑶族自治县','七星区','叠彩区','兴安县','全州县','临桂县','平乐县','龙胜各族自治县','阳朔县','雁山区','灌阳县','象山区','其它区']},
	{city:'玉林市',data:['兴业县','陆川县','容县','博白县','玉州区','其它区','北流市']},
	{city:'梧州市',data:['岑溪市','藤县','苍梧县','蝶山区','万秀区','长洲区','蒙山县','其它区']},
	{city:'南宁市',data:['上林县','宾阳县','青秀区','兴宁区','马山县','良庆区','武鸣县','西乡塘区','横县','隆安县','其它区','邕宁区','江南区']},
	{city:'北海市',data:['铁山港区','银海区','海城区','合浦县','其它区']}
];

//海南省
city[21] = [
	{city:'文昌市',data:['文昌市']},
	{city:'琼中黎族苗族自治县',data:['琼中黎族苗族自治县']},
	{city:'三亚市',data:['三亚市']},
	{city:'澄迈县',data:['澄迈县']},
	{city:'临高县',data:['临高县']},
	{city:'昌江黎族自治县',data:['昌江黎族自治县']},
	{city:'五指山市',data:['五指山市']},
	{city:'白沙黎族自治县',data:['白沙黎族自治县']},
	{city:'海口市',data:['秀英区','美兰区','龙华区','琼山区','其它区']},
	{city:'屯昌县',data:['屯昌县']},
	{city:'中沙群岛的岛礁及其海域',data:['中沙群岛的岛礁及其海域']},
	{city:'儋州市',data:['儋州市']},
	{city:'陵水黎族自治县',data:['陵水黎族自治县']},
	{city:'西沙群岛',data:['西沙群岛']},
	{city:'万宁市',data:['万宁市']},
	{city:'乐东黎族自治县',data:['乐东黎族自治县']},
	{city:'定安县',data:['定安县']},
	{city:'保亭黎族苗族自治县',data:['保亭黎族苗族自治县']},
	{city:'东方市',data:['东方市']},
	{city:'南沙群岛',data:['南沙群岛']},
	{city:'琼海市',data:['琼海市']}
];

//四川省
city[22] = [
	{city:'成都市',data:['都江堰市','崇州市','龙泉驿区','金堂县','成华区','蒲江县','锦江区','武侯区','大邑县','彭州市','邛崃市','温江区','青白江区','青羊区','双流县','金牛区','新津县','郫县','新都区','其它区']},
	{city:'德阳市',data:['什邡市','广汉市','中江县','罗江县','绵竹市','旌阳区','其它区']},
	{city:'绵阳市',data:['涪城区','梓潼县','江油市','三台县','高新区','北川羌族自治县','游仙区','安县','盐亭县','平武县','其它区']},
	{city:'泸州市',data:['古蔺县','泸县','叙永县','龙马潭区','合江县','江阳区','其它区','纳溪区']},
	{city:'广元市',data:['旺苍县','利州区','剑阁县','苍溪县','元坝区','朝天区','其它区','青川县']},
	{city:'攀枝花市',data:['东区','盐边县','仁和区','米易县','西区','其它区']},
	{city:'内江市',data:['资中县','东兴区','隆昌县','市中区','威远县','其它区']},
	{city:'眉山市',data:['仁寿县','洪雅县','青神县','彭山县','丹棱县','其它区','东坡区']},
	{city:'南充市',data:['高坪区','顺庆区','南部县','仪陇县','蓬安县','嘉陵区','阆中市','营山县','西充县','其它区']},
	{city:'乐山市',data:['峨眉山市','峨边彝族自治县','井研县','五通桥区','犍为县','马边彝族自治县','市中区','沐川县','沙湾区','金口河区','夹江县','其它区']},
	{city:'雅安市',data:['荥经县','宝兴县','石棉县','名山县','天全县','雨城区','汉源县','芦山县','其它区']},
	{city:'阿坝藏族羌族自治州',data:['若尔盖县','茂县','阿坝县','马尔康县','汶川县','壤塘县','小金县','松潘县','理县','九寨沟县','黑水县','其它区','红原县','金川县']},
	{city:'资阳市',data:['安岳县','简阳市','乐至县','雁江区','其它区']},
	{city:'凉山彝族自治州',data:['西昌市','美姑县','越西县','盐源县','雷波县','喜德县','金阳县','甘洛县','布拖县','木里藏族自治县','宁南县','昭觉县','会理县','德昌县','普格县','会东县','冕宁县','其它区']},
	{city:'自贡市',data:['富顺县','贡井区','自流井区','沿滩区','大安区','其它区','荣县']},
	{city:'甘孜藏族自治州',data:['丹巴县','泸定县','得荣县','道孚县','乡城县','巴塘县','石渠县','稻城县','雅江县','九龙县','康定县','新龙县','炉霍县','色达县','理塘县','甘孜县','德格县','白玉县','其它区']},
	{city:'遂宁市',data:['安居区','船山区','蓬溪县','大英县','射洪县','其它区']},
	{city:'广安市',data:['武胜县','广安区','市辖区','邻水县','岳池县','其它区','华蓥市']},
	{city:'宜宾市',data:['翠屏区','南溪县','江安县','筠连县','珙县','长宁县','屏山县','宜宾县','兴文县','其它区','高县']},
	{city:'巴中市',data:['巴州区','平昌县','通江县','南江县','其它区']},
	{city:'达州市',data:['渠县','达县','大竹县','宣汉县','开江县','通川区','万源市','其它区']}
];

//贵州省
city[23] = [
	{city:'遵义市',data:['湄潭县','赤水市','遵义县','道真仡佬族苗族自治县','绥阳县','凤冈县','正安县','桐梓县','仁怀市','习水县','务川仡佬族苗族自治县','汇川区','红花岗区','余庆县','其它区']},
	{city:'六盘水市',data:['六枝特区','盘县','钟山区','水城县','其它区']},
	{city:'黔南布依族苗族自治州',data:['龙里县','长顺县','独山县','都匀市','三都水族自治县','荔波县','惠水县','贵定县','福泉市','平塘县','其它区','罗甸县','瓮安县']},
	{city:'黔东南苗族侗族自治州',data:['岑巩县','台江县','黄平县','麻江县','剑河县','镇远县','凯里市','黎平县','雷山县','榕江县','丹寨县','三穗县','施秉县','锦屏县','其它区','从江县','天柱县']},
	{city:'安顺市',data:['平坝县','西秀区','紫云苗族布依族自治县','普定县','镇宁布依族苗族自治县','关岭布依族苗族自治县','其它区']},
	{city:'毕节地区',data:['赫章县','黔西县','大方县','金沙县','毕节市','纳雍县','其它区','织金县','威宁彝族回族苗族自治县']},
	{city:'贵阳市',data:['乌当区','花溪区','清镇市','息烽县','金阳开发区','云岩区','开阳县','小河区','南明区','白云区','其它区','修文县']},
	{city:'铜仁地区',data:['沿河土家族自治县','铜仁市','石阡县','江口县','德江县','松桃苗族自治县','玉屏侗族自治县','印江土家族苗族自治县','万山特区','其它区','思南县']},
	{city:'黔西南布依族苗族自治州',data:['望谟县','兴义市','普安县','册亨县','安龙县','兴仁县','晴隆县','其它区','贞丰县']}
];

//云南省
city[24] = [
	{city:'临沧市',data:['临翔区','云县','双江拉祜族佤族布朗族傣族自治县','凤庆县','镇康县','沧源佤族自治县','其它区','永德县','耿马傣族佤族自治县']},
	{city:'怒江傈僳族自治州',data:['贡山独龙族怒族自治县','泸水县','福贡县','其它区','兰坪白族普米族自治县']},
	{city:'保山市',data:['施甸县','隆阳区','腾冲县','其它区','昌宁县','龙陵县']},
	{city:'德宏傣族景颇族自治州',data:['盈江县','潞西市','瑞丽市','梁河县','陇川县','其它区']},
	{city:'楚雄彝族自治州',data:['楚雄市','禄丰县','双柏县','牟定县','南华县','武定县','姚安县','永仁县','大姚县','其它区','元谋县']},
	{city:'玉溪市',data:['江川县','新平彝族傣族自治县','通海县','红塔区','华宁县','澄江县','易门县','峨山彝族自治县','元江哈尼族彝族傣族自治县','其它区']},
	{city:'曲靖市',data:['麒麟区','罗平县','富源县','沾益县','陆良县','马龙县','会泽县','其它区','宣威市','师宗县']},
	{city:'昆明市',data:['寻甸回族彝族自治县','呈贡县','五华区','西山区','东川区','安宁市','盘龙区','宜良县','官渡区','富民县','石林彝族自治县','晋宁县','禄劝彝族苗族自治县','嵩明县','其它区']},
	{city:'迪庆藏族自治州',data:['德钦县','香格里拉县','维西傈僳族自治县','其它区']},
	{city:'文山壮族苗族自治州',data:['富宁县','马关县','文山县','砚山县','麻栗坡县','丘北县','广南县','其它区','西畴县']},
	{city:'普洱市',data:['景谷傣族彝族自治县','澜沧拉祜族自治县','西盟佤族自治县','孟连傣族拉祜族佤族自治县','景东彝族自治县','江城哈尼族彝族自治县','宁洱哈尼族彝族自治县','墨江哈尼族自治县','镇沅彝族哈尼族拉祜族自治县','思茅区','其它区']},
	{city:'大理白族自治州',data:['南涧彝族自治县','巍山彝族回族自治县','云龙县','漾濞彝族自治县','宾川县','鹤庆县','洱源县','永平县','弥渡县','剑川县','祥云县','大理市','其它区']},
	{city:'红河哈尼族彝族自治州',data:['蒙自县','弥勒县','红河县','绿春县','个旧市','元阳县','石屏县','开远市','建水县','屏边苗族自治县','河口瑶族自治县','金平苗族瑶族傣族自治县','其它区','泸西县']},
	{city:'昭通市',data:['彝良县','大关县','盐津县','永善县','绥江县','威信县','水富县','鲁甸县','镇雄县','昭阳区','巧家县','其它区']},
	{city:'丽江市',data:['永胜县','华坪县','宁蒗彝族自治县','玉龙纳西族自治县','古城区','其它区']},
	{city:'西双版纳傣族自治州',data:['景洪市','其它区','勐海县','勐腊县']}
];

//西藏自治区
city[25] = [
	{city:'林芝地区',data:['墨脱县','工布江达县','米林县','波密县','察隅县','林芝县','其它区','朗县']},
	{city:'昌都地区',data:['江达县','洛隆县','边坝县','贡觉县','昌都县','类乌齐县','芒康县','丁青县','其它区','左贡县','八宿县','察雅县']},
	{city:'阿里地区',data:['普兰县','革吉县','日土县','改则县','噶尔县','札达县','措勤县','其它区']},
	{city:'日喀则地区',data:['萨嘎县','萨迦县','白朗县','仲巴县','南木林县','吉隆县','日喀则市','江孜县','谢通门县','昂仁县','定日县','亚东县','康马县','岗巴县','仁布县','聂拉木县','定结县','其它区','拉孜县']},
	{city:'那曲地区',data:['嘉黎县','申扎县','尼玛县','那曲县','安多县','巴青县','聂荣县','班戈县','索县','比如县','其它区']},
	{city:'拉萨市',data:['当雄县','墨竹工卡县','曲水县','达孜县','堆龙德庆县','林周县','城关区','其它区','尼木县']},
	{city:'山南地区',data:['加查县','琼结县','乃东县','浪卡子县','错那县','贡嘎县','隆子县','扎囊县','措美县','洛扎县','曲松县','桑日县','其它区']}
];

//陕西省
city[26] = [
	{city:'渭南市',data:['潼关县','华阴市','白水县','大荔县','澄城县','韩城市','蒲城县','华县','临渭区','富平县','合阳县','其它区']},
	{city:'榆林市',data:['神木县','靖边县','绥德县','榆阳区','横山县','府谷县','子洲县','佳县','米脂县','吴堡县','清涧县','定边县','其它区']},
	{city:'宝鸡市',data:['陈仓区','太白县','陇县','岐山县','凤县','千阳县','眉县','扶风县','麟游县','凤翔县','渭滨区','其它区','金台区']},
	{city:'汉中市',data:['汉台区','西乡县','洋县','佛坪县','镇巴县','略阳县','城固县','留坝县','勉县','宁强县','其它区','南郑县']},
	{city:'咸阳市',data:['杨凌区','旬邑县','长武县','渭城区','乾县','淳化县','兴平市','泾阳县','武功县','秦都区','礼泉县','彬县','永寿县','三原县','其它区']},
	{city:'商洛市',data:['镇安县','洛南县','丹凤县','山阳县','商州区','其它区','商南县','柞水县']},
	{city:'西安市',data:['阎良区','新城区','雁塔区','高陵县','临潼区','户县','灞桥区','碑林区','蓝田县','周至县','未央区','莲湖区','其它区','长安区']},
	{city:'安康市',data:['宁陕县','旬阳县','石泉县','镇坪县','汉阴县','汉滨区','白河县','岚皋县','紫阳县','平利县','其它区']},
	{city:'铜川市',data:['耀州区','宜君县','王益区','印台区','其它区']},
	{city:'延安市',data:['延长县','黄陵县','志丹县','黄龙县','延川县','吴起县','子长县','宜川县','甘泉县','宝塔区','安塞县','洛川县','富县','其它区']}
];

//甘肃省
city[27] = [
	{city:'平凉市',data:['崇信县','庄浪县','灵台县','泾川县','崆峒区','华亭县','其它区','静宁县']},
	{city:'白银市',data:['平川区','会宁县','靖远县','景泰县','白银区','其它区']},
	{city:'武威市',data:['古浪县','民勤县','凉州区','天祝藏族自治县','其它区']},
	{city:'临夏回族自治州',data:['东乡族自治县','广河县','永靖县','和政县','临夏市','康乐县','临夏县','积石山保安族东乡族撒拉族自治县','其它区']},
	{city:'陇南市',data:['武都区','文县','康县','礼县','徽县','宕昌县','成县','其它区','两当县','西和县']},
	{city:'嘉峪关市',data:['嘉峪关市']},
	{city:'张掖市',data:['民乐县','高台县','甘州区','临泽县','山丹县','肃南裕固族自治县','其它区']},
	{city:'甘南藏族自治州',data:['卓尼县','临潭县','碌曲县','迭部县','夏河县','舟曲县','合作市','其它区','玛曲县']},
	{city:'天水市',data:['武山县','甘谷县','清水县','张家川回族自治县','秦安县','麦积区','秦州区','其它区']},
	{city:'定西市',data:['临洮县','渭源县','陇西县','安定区','漳县','其它区','通渭县','岷县']},
	{city:'金昌市',data:['永昌县','金川区','其它区']},
	{city:'庆阳市',data:['华池县','正宁县','庆城县','宁县','合水县','镇原县','西峰区','环县','其它区']},
	{city:'兰州市',data:['七里河区','永登县','安宁区','西固区','皋兰县','城关区','榆中县','其它区','红古区']},
	{city:'酒泉市',data:['敦煌市','玉门市','肃北蒙古族自治县','肃州区','金塔县','安西县','阿克塞哈萨克族自治县','其它区']}
];

//青海省
city[28] = [
	{city:'海南藏族自治州',data:['同德县','共和县','兴海县','贵南县','其它区','贵德县']},
	{city:'西宁市',data:['湟中县','城西区','城东区','城中区','湟源县','大通回族土族自治县','城北区','其它区']},
	{city:'玉树藏族自治州',data:['称多县','囊谦县','曲麻莱县','治多县','杂多县','玉树县','其它区']},
	{city:'海西蒙古族藏族自治州',data:['乌兰县','德令哈市','都兰县','天峻县','格尔木市','其它区']},
	{city:'黄南藏族自治州',data:['河南蒙古族自治县','尖扎县','同仁县','泽库县','其它区']},
	{city:'海北藏族自治州',data:['祁连县','刚察县','门源回族自治县','海晏县','其它区']},
	{city:'海东地区',data:['互助土族自治县','民和回族土族自治县','化隆回族自治县','乐都县','其它区','平安县','循化撒拉族自治县']},
	{city:'果洛藏族自治州',data:['玛多县','久治县','甘德县','其它区','班玛县','达日县','玛沁县']}
];

//宁夏回族自治区
city[29] = [
	{city:'中卫市',data:['沙坡头区','中宁县','海原县','其它区']},
	{city:'吴忠市',data:['青铜峡市','利通区','同心县','盐池县','红寺堡区','其它区']},
	{city:'固原市',data:['原州区','西吉县','彭阳县','泾源县','隆德县','其它区']},
	{city:'银川市',data:['灵武市','兴庆区','永宁县','西夏区','贺兰县','金凤区','其它区']},
	{city:'石嘴山市',data:['大武口区','平罗县','惠农区','其它区']}
];

//新疆维吾尔自治区
city[30] = [
	{city:'昌吉回族自治州',data:['昌吉市','阜康市','呼图壁县','吉木萨尔县','米泉市','木垒哈萨克自治县','玛纳斯县','奇台县','其它区']},
	{city:'乌鲁木齐市',data:['头屯河区','东山区','达坂城区','水磨沟区','新市区','天山区','乌鲁木齐县','米东区','沙依巴克区','其它区']},
	{city:'图木舒克市',data:['图木舒克市']},
	{city:'和田地区',data:['洛浦县','和田市','皮山县','策勒县','民丰县','墨玉县','于田县','其它区','和田县']},
	{city:'克拉玛依市',data:['独山子区','乌尔禾区','克拉玛依区','白碱滩区','其它区']},
	{city:'塔城地区',data:['托里县','和布克赛尔蒙古自治县','乌苏市','裕民县','塔城市','额敏县','其它区','沙湾县']},
	{city:'哈密地区',data:['巴里坤哈萨克自治县','伊吾县','哈密市','其它区']},
	{city:'吐鲁番地区',data:['吐鲁番市','托克逊县','鄯善县','其它区']},
	{city:'石河子市',data:['石河子市']},
	{city:'阿克苏地区',data:['拜城县','阿瓦提县','柯坪县','温宿县','沙雅县','新和县','库车县','阿克苏市','乌什县','其它区']},
	{city:'巴音郭楞蒙古自治州',data:['若羌县','和硕县','焉耆回族自治县','且末县','轮台县','博湖县','库尔勒市','尉犁县','其它区','和静县']},
	{city:'喀什地区',data:['莎车县','疏附县','麦盖提县','喀什市','泽普县','叶城县','英吉沙县','巴楚县','塔什库尔干塔吉克自治县','伽师县','岳普湖县','疏勒县','其它区']},
	{city:'克孜勒苏柯尔克孜自治州',data:['乌恰县','阿合奇县','阿克陶县','阿图什市','其它区']},
	{city:'阿拉尔市',data:['阿拉尔市']},
	{city:'阿勒泰地区',data:['吉木乃县','布尔津县','阿勒泰市','哈巴河县','富蕴县','福海县','其它区','青河县']},
	{city:'伊犁哈萨克自治州',data:['察布查尔锡伯自治县','霍城县','尼勒克县','伊宁市','奎屯市','新源县','特克斯县','昭苏县','巩留县','伊宁县','其它区']},
	{city:'五家渠市',data:['五家渠市']},
	{city:'博尔塔拉蒙古自治州',data:['温泉县','精河县','博乐市','其它区']}
];

//澳门特别行政区
city[31] = [
	{city:'澳门半岛',data:['澳门半岛']},
	{city:'离岛',data:['离岛']}
];

//海外
city[32] = [
	{city:'海外',data:['海外']}
];


$j(document).ready(function(){	 
    for(var pro = 0; pro < province.length; pro++){
        var op = $j('<option value='+ pro + '>'+ province[pro] +'</option>');
		op.appendTo($j(provinceSelector));
 	}
    
	$j(provinceSelector).change(addCity);
 	$j(citySelector).change(addData);
});




/**
 * 添加城市
 * @param event
 * @param proIndex
 */
function addCity(event,proIndex){
    if(proIndex == undefined){
        proIndex = $j(provinceSelector).val();
    }
    
    clearCity();
    
    var cityNames=[];
    if(city[proIndex] != undefined){
    	for(var i=0; i< city[proIndex].length; i++){
    		var cityName=city[proIndex][i].city;
            var op = $j('<option value='+ i + '>'+ cityName +'</option>');
            op.appendTo($j(citySelector));
            
            cityNames[i]=cityName;
        }    	
    }    
    clearDistrict();
    return cityNames;
}

/**
 * 数据
 * @param event
 * @param proIndex
 */
function addData(event,proIndex){
    if(proIndex == undefined){
        proIndex = $j(provinceSelector).val();
    }	
    clearDistrict(); 
    if(city[proIndex] != undefined){
    	for(var i=0; i< city[proIndex].length; i++){
    		var cities = city[proIndex][i];	
    		if (cities.city == $j(citySelector).find("option:selected").text()) {
    			
		      var res = cities.data;

		      if( res != undefined ){
		    	  var districtNames=[];
			      for(var j=0; j<res.length; j++){
			    	  var districtName=res[j];
			    	  var op = $j('<option value='+ j + '>'+  districtName +'</option>');
			          op.appendTo($j(districtSelector));
			          
			          districtNames[j]=districtName;
			      }
			      
			      return districtNames;
		      }		  
    		}
        }
    }	
}

/**
 * 初始默认的地区
 */
function initDefaultAreaSelect(areaProvinceDefaultValue,areaCityDefaultValue,areaDistrictDefaultValue){
	if(""!=areaProvinceDefaultValue){
		var p_index=getArrayIndexByContent(province,areaProvinceDefaultValue);
		if(p_index>=0){
			//如果 是ie6.0 版本 ，什么都不做
			if ( $j.browser.msie&&parseInt($j.browser.version )==6) {
				//nothing todo
			}else{
				$j(provinceSelector).val(p_index);
				 var cityNames=addCity();
				 var c_index=getArrayIndexByContent(cityNames,areaCityDefaultValue);
				 
				 if(c_index>=0){
					 $j(citySelector).val(c_index);
					 
					 var districtNames= addData();
					 var d_index=getArrayIndexByContent(districtNames,areaDistrictDefaultValue);
					 
					 if(d_index>=0){
						 $j(districtSelector).val(d_index);
					 }
				 }
			}
		}
	}
}

 /**
  *  获得 数组 索引值
  * @param array
  * @param content
  * @returns
  */
function getArrayIndexByContent(array,content){
	var returnIndex;
	$j(array).each(function(i,a){
		if(a==content){
			returnIndex=i;
			return false;
		}
	});
	return returnIndex;
}

/**
 * 清空city
 */
function clearCity(){
    $j(citySelector+'>option').remove();
    var op = $j("<option value=''>"+defaultCityText+"</option>");
    op.appendTo($j(citySelector));  
}

/**
 * 清空District
 */
function clearDistrict(){
    $j(districtSelector+'>option').remove();
    var op = $j("<option value=''>"+defaultDistrictText+"</option>");
    op.appendTo($j(districtSelector));
}
